Repository: yara30999/cat_gallery
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: no_route_found
ar: لم يتم العثور على المسار

source: Cat Gallery
ar: معرض القطط

source: Hello!
ar: مرحباً!

source: Create Account
ar: إنشاء حساب

# loginTitle
source: Sign into your Account.
ar: تسجيل الدخول إلى حسابك.

# emailLabel
source: Email Id
ar: البريد الإلكتروني

# usernameLabel
source: Username
ar: اسم المستخدم

# passwordLabel
source: Password
ar: كلمة المرور

# passwordConfirmLabel
source: Confirm Password
ar: تأكيد كلمة المرور

# loginLabel
source: Login
ar: تسجيل الدخول

# registerLabel
source: Register
ar: تسجيل

source: Forgot Your Password?
ar: هل نسيت كلمة المرور؟

source: Or Continue With
ar: أو تابع مع

source: Not a member?
ar: لست عضوا؟

source: Already have an account?
ar: لديك حساب؟

# emptyMsg
source: Field is required
ar: الحقل مطلوب

# passwordNotValid
source: Password must be at least 6 characters long
ar: يجب أن تكون كلمة المرور مكونة من 6 أحرف على الأقل

source: Passwords do not match
ar: كلمة المرور غير مطابقة

source: Username too short
ar: اسم المستخدم قصير جدًا

source: Username too long
ar: اسم المستخدم طويل جدًا

source: Username not valid
ar: اسم المستخدم غير صالح

# emailNotValid
source: Email not formatted well
ar: البريد الإلكتروني غير منسق بشكل جيد

# appTitle
source: Flutter cat information app
ar: تطبيق معلومات القطط باستخدام فلاتر

source: Search country
ar: ابحث عن الدولة

source: Phone Number
ar: رقم الهاتف

# do_not_type_country_code_again
source: Do not type the country code again
ar: لا تكتب رمز البلد مرة أخرى

source: Phone number is required
ar: رقم الهاتف مطلوب

source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صالح

# phone_number_length_invalid
source: Phone number length is invalid
ar: طول رقم الهاتف غير صحيح

# country_number_length_not_found
source: Country data not found
ar: بيانات البلد غير موجودة

source: Male
ar: ذكر

source: Female
ar: أنثى

# genderRequired
source: Gender is required
ar: الحقل مطلوب

source: Select Gender
ar: اختر الجنس

source: Home
ar: الرئيسية

source: Favorites
ar: المفضلة

source: Uploads
ar: الملفات المرفوعة

source: Votes
ar: التصويتات

source: Vote
ar: صوت

source: Search by breed name...
ar: إبحث حسب إسم السلاله ...

source: main breeds
ar: السلالات الرئيسية

source: Browse random images of all breeds.
ar: تصفح الصور العشوائية لجميع السلالات.

# main_breed_paragraph
source: Or choose a specific cat breed to browse images with.
ar: أو اختر سلالة معينة من القطط لتصفح الصور بها.

source: random cat images
ar: صور قطط عشوائية

# breed_cat_images
source: {breedName} cat images
ar: صور القط {breedName}

# upload_breed
source: breed: {breedName}
ar: سلالة: {breedName}

# upload_category
source: category: {categoryName}
ar: فئة: {categoryName}

source: all
ar: الكل

source: hats
ar: قبعات

source: space
ar: فضاء

source: funny
ar: مضحك

source: sunglasses
ar: نظارات شمسية

source: boxes
ar: صناديق

source: caturday
ar: يوم القط

source: ties
ar: ربطات عنق

source: boys
ar: أولاد

source: dream
ar: حلم

source: kittens
ar: قطط صغيرة

source: psychedelic
ar: هلوسه

source: girls
ar: بنات

source: breaded
ar: مغلف

source: sinks
ar: أحواض مياه

source: clothes
ar: ملابس

# asc
source: ascending
ar: تصاعدي

# desc
source: descending
ar: تنازلي

source: random
ar: عشوائي

# adabtability
source: Adaptability
ar: التكيف

source: Child Friendly
ar: صديق للأطفال

source: Dog Friendly
ar: صديق للكلاب

source: Stranger Friendly
ar: صديق للغرباء

source: Health Issues
ar: مشاكل صحية

source: Social Needs
ar: إحتياجات إجتماعية

source: Shedding
ar: تساقط الشعر

source: Affection
ar: المودة

source: Energy
ar: الطاقة

source: Grooming
ar: الحاجه للتنظيف

source: Intelligence
ar: الذكاء

# cat_weight_range
source: The {catBreed} has a weight range of {weightImperial} pounds ({weightMetric} kg).
ar: القط {catBreed} لديه نطاق وزن من {weightImperial} أرطال ({weightMetric} كجم).

# cat_temperament
source: These cats possess a temperament that is {temperament}.
ar: تتمتع هذه القطط بمزاج {temperament}.

# cat_lifespan
source: Their typical lifespan ranges from {lifeSpan} years.
ar: يتراوح عمرها النموذجي من {lifeSpan} سنوات.

# cat_origin
source: The breed originates from {origin}.
ar: تنحدر السلالة من {origin}.

# more_information
source: For more information, you can visit their
ar: لمزيد من المعلومات، يمكنك زيارة

source: Vetstreet page
ar: صفحة فيتستريت

source: Wikipedia page
ar: صفحة ويكيبيديا

source: or
ar: أو

source: to
ar: إلى

source: image analysis
ar: تحليل الصورة

source: we are using AWS Rekognition.
ar: نحن نستخدم AWS Rekognition.

source: Go Back
ar: رجوع

source: Mr.
ar: السيد

source: Mrs.
ar: السيدة

# app_developer
source: App developer: Eng. Yara Nasser Elniny yaranasserelniny@gmail.com 01093017989
ar: مطور التطبيق: م. يارا ناصر الدين النني yaranasserelniny@gmail.com 01093017989

source: Theme:
ar: السمة:

source: System
ar: النظام

source: Light
ar: فاتح

source: Dark
ar: داكن

source: Language:
ar: اللغة:

source: English
ar: إنجليزي

source: Arabic
ar: عربي

source: Logout account
ar: تسجيل خروج

source: Failed to load image.
ar: فشل تحميل الصورة.

# upload_image
source: upload cat image
ar: تحميل صورة

# remember
source: Remember: The image you upload must contain a cat, otherwise it will not be uploaded.
ar: تذكر: الصوره التي ستقوم بتحميلها يجب ان تحتوى على قطه، والا لن يتم تحميلها.

source: Gallery
ar: المعرض

source: Camera
ar: الكاميرا

source: Add image file.
ar: أضف ملف الصورة.

source: Click or Drag image file.
ar: انقر أو اسحب ملف الصورة.

# selected_category
source: Selected category: {categoryName}
ar: الفئة المختاره: {categoryName}

source: Nothing
ar: لا شيء

source: Optional
ar: إختياري

source: Select Category:
ar: إختر الفئة:

# do_not_know_category
source: I don't know the category.
ar: لا أعرف الفئة.

# selected_breed
source: Selected breed: {breedName}
ar: الفصيلة المختاره: {breedName}

source: Select Breed:
ar: إختر الفصيلة:

# do_not_know_breed
source: I don't know the breed.
ar: لا أعرف الفصيلة.

source: Upload
ar: تحميل

source: success
ar: تم بنجاح

# bad_request_error
source: bad request. try again later
ar: طلب غير صالح. حاول مرة أخرى لاحقًا

# incorrect_certificate_error
source: incorrect certificate
ar: شهادة غير صحيحة

# unauthorized_error
source: user unauthorized, try again later
ar: المستخدم غير مصرح به، حاول مرة أخرى لاحقًا

# forbidden_error
source: forbidden request. try again later
ar: طلب ممنوع. حاول مرة أخرى في وقت لاحق

# internal_server_error
source: some thing went wrong, try again later
ar: حدث خطأ ما، حاول مرة أخرى لاحقًا

# not_found_error
source: url not found, try again later
ar: لم يتم العثور على عنوان URL، حاول مرة أخرى لاحقًا

# connection_timeout_error
source: Time out error, Try again later
ar: خطأ في انتهاء المهلة، حاول مرة أخرى لاحقًا

# cancel_error
source: Request was cancelled, Try again later
ar: تم إلغاء الطلب، حاول مرة أخرى لاحقاً

# recieve_timeout_error
source: Recieve time out error, Try again later
ar: تلقي خطأ انتهاء المهلة، حاول مرة أخرى لاحقًا

# send_timeout_error
source: Send time out error, Try again later
ar: أرسل خطأ انتهاء المهلة، حاول مرة أخرى لاحقًا

# cache_error
source: cache error, try again later
ar: خطأ في ذاكرة التخزين المؤقت، حاول مرة أخرى لاحقًا

# no_internet_connection_error
source: Please check your internet connection
ar: الرجاء التحقق من اتصال الانترنت الخاص بك

# unknown_error
source: some thing went wrong, try again later
ar: حدث خطأ ما، حاول مرة أخرى لاحقًا

# no_content
source: success with not content
ar: تم بنجاح مع عدم وجود محتوى

# conflict_error
source: conflict found, try again later
ar: تم العثور على تعارض، حاول مرة أخرى لاحقًا

# default_error
source: some thing went wrong, try again later
ar: حدث خطأ ما، حاول مرة أخرى لاحقًا

source: Loading ...
ar: جاري التحميل ...

# google
source: Google sign-in was canceled or failed
ar: تم إلغاء تسجيل الدخول عبر جوجل أو فشل

# facebook
source: Facebook sign-in was canceled or failed
ar: تم إلغاء تسجيل الدخول عبر فيسبوك أو فشل

# week_password
source: The password provided is too weak.
ar: كلمة المرور المقدمة ضعيفة جدًا.

# email_exists
source: The account already exists for that email.
ar: الحساب موجود بالفعل لتلك البريد الإلكتروني.

# user_not_found
source: No user found for that email.
ar: لم يتم العثور على مستخدم لتلك البريد الإلكتروني.

# wrong_password
source: Wrong password provided for that user.
ar: كلمة المرور المقدمة غير صحيحة لهذا المستخدم.

# invalid_credential
source: Wrong password or username.
ar: اسم المستخدم أو كلمة المرور غير صحيحة.

# too_many_requests
source: Too many requests, please try again later.
ar: تم إرسال الكثير من الطلبات، يرجى المحاولة لاحقًا.

# invalid_email
source: Sorry, this email is invalid.
ar: عذرًا، هذا البريد الإلكتروني غير صالح.

# opration_not_allowed
source: Operation not allowed, please try again later.
ar: العملية غير مسموح بها، يرجى المحاولة لاحقًا.

# different_credential
source: This account exists with different credential.
ar: هذا الحساب موجود بمصادقة مختلفة.

# invalid_continue_uri
source: The continue URL provided in the request is invalid.
ar: عنوان المتابعة المقدم في الطلب غير صالح.

# unauthorized_continue_uri
source: The domain of the continue URL is not whitelisted. Whitelist the domain in the Firebase console.
ar: نطاق عنوان المتابعة غير مضاف إلى القائمة البيضاء.

# no_worries
source: No worries, we will send you reset instructions.
ar: لا تقلق، سنرسل لك تعليمات إعادة التعيين.

source: Reset password
ar: إعادة تعيين كلمة المرور

source: Go back to login
ar: العودة إلى تسجيل الدخول

# reset_password_mail_sent
source: Reset password mail has been sent successfully to your email, go check.
ar: تم إرسال بريد إعادة تعيين كلمة المرور بنجاح إلى بريدك الإلكتروني، تحقق منه.
